hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/HPM5E00/HPM5E11/HPM5E11_svd.xml
          <register>
            <name>TRIGCTRL</name>
            <description>Trigger Control Register</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFCCF</resetMask>
            <fields>
              <field>
                <name>TRACE</name>
                <description>Trace capture control.
0b10 Trace is captured every ELACLK cycle.
others Reserved.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>COMPSEL</name>
                <description>Comparison mode. Acts as both a counter enable and a select for the comparison mode.
0b0 Disable counters and select Trigger Signal Comparison mode.
0b1 Enable counters and select Trigger Counter Comparison mode.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>COMP</name>
                <description>Trigger Signal Comparison type select.
0b000 Trigger Signal Comparisons disabled. The enabled counters count clocks immediately after the Trigger State has been entered and generate a programmable Output Action and transition to the next Trigger State when the Counter Compare Register count is reached, that is when a Trigger Counter Comparison match occurs.
0b001 Compare type is equal (==).
0b010 Compare type is greater than (&gt;).
0b011 Compare type is greater than or equal (&gt;=).
0b101 Compare type is not equal (!=).
0b110 Compare type is less than (&lt;).
0b111 Compare type is less than or equal (&lt;=).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>NEXTSTATE</name>
            <description>Next State Register</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>NEXTSTATE</name>
                <description>Selects the next state to move to after the Trigger Condition has been met in the current state.
0x0 Do not change state. This is the final Trigger State.
0x1 Selects Trigger State 0.
0x2 Selects Trigger State 1.
0x4 Selects Trigger State 2.
0x8 Selects Trigger State 3.
0x10 Selects Trigger State 4.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ACTION</name>
            <description>Action Register</description>
            <addressOffset>0xc</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TRACE</name>
                <description>Trace active.
0b0 Trace disable.
0b1 Trace enable.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>COUNTCOMP</name>
            <description>Counter Compare Register</description>
            <addressOffset>0x20</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VALUE</name>
                <description>A value that, when reached in the associated up-counter for this Trigger State, causes a Trigger Counter Comparison match to occur.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>EXTMASK</name>
            <description>External Mask Register</description>
            <addressOffset>0x30</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VALUE</name>
                <description>External Mask</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>EXTCOMP</name>
            <description>External Compare Register</description>
            <addressOffset>0x34</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VALUE</name>
                <description>External Compare</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SIGMASK</name>
            <description>Signal Mask Register</description>
            <addressOffset>0x40</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>NUM3</name>
                <description>Select compare signal number3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>NUM2</name>
                <description>Select compare signal number2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>NUM1</name>
                <description>Select compare signal number1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>NUM0</name>
                <description>Select compare signal number0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>COMPEN</name>
            <description>Compare Enable register</description>
            <addressOffset>0x44</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0000001F</resetMask>
            <fields>
              <field>
                <name>COMPLOGIC</name>
                <description>compare logic
0 and : compare signals must match simultaneously,then trigger
1 or : compare signals only need 1 signal match,then trigger</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EN</name>
                <description>Select compare signal number0-3</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SIGCOMP0</name>
            <description>Signal Compare Register0</description>
            <addressOffset>0x80</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VALUE0</name>
                <description>Compare golden value for Signal Group signals[31:0].</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SIGCOMP1</name>
            <description>Signal Compare Register1</description>
            <addressOffset>0x84</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VALUE1</name>
                <description>Compare golden value for Signal Group signals[63:32].</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SIGCOMP2</name>
            <description>Signal Compare Register2</description>
            <addressOffset>0x88</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VALUE2</name>
                <description>Compare golden value for Signal Group signals[95:64].</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SIGCOMP3</name>
            <description>Signal Compare Register3</description>
            <addressOffset>0x8c</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VALUE3</name>
                <description>Compare golden value for Signal Group signals[127:96].</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>LAR</name>
          <description>Lock Access Register</description>
          <addressOffset>0xfb0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Lock Access Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
