hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/HPM5E00/HPM5E11/HPM5E11_svd.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>ESC</name>
      <description>ESC</description>
      <groupName>ESC</groupName>
      <baseAddress>0xf1700000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1f0a4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>TYPE</name>
          <description>Type of EtherCAT controller</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <resetValue>0xA2</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>TYPE</name>
              <description>Controller type</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REVISION</name>
          <description>Revision of EtherCAT controller</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>X</name>
              <description>major version X</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUILD</name>
          <description>Build of EtherCAT controller</description>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BUILD</name>
              <description>No description available</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Y</name>
              <description>minor version Y</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Z</name>
              <description>maintenance version Z</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FMMU_NUM</name>
          <description>FMMU supported</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <resetValue>0x08</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>NUM</name>
              <description>Number of supported FMMU channels (or entities)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCM_NUM</name>
          <description>SyncManagers supported</description>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
          <resetValue>0x08</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>NUM</name>
              <description>Number of supported SyncManager channels (or entities)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM_SIZE</name>
          <description>RAM Size</description>
          <addressOffset>0x6</addressOffset>
          <size>8</size>
          <resetValue>0x3C</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>SIZE</name>
              <description>Process Data RAM size supported in KByte</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PORT_DESC</name>
          <description>Port Descriptor</description>
          <addressOffset>0x7</addressOffset>
          <size>8</size>
          <resetValue>0x3F</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PORT3</name>
              <description>Port configuration:
00:Not implemented
01:Not configured (SII EEPROM)
10:EBUS
11:MII/RMII/RGMII</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PORT2</name>
              <description>Port configuration:
00:Not implemented
01:Not configured (SII EEPROM)
10:EBUS
11:MII/RMII/RGMII</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PORT1</name>
              <description>Port configuration:
00:Not implemented
01:Not configured (SII EEPROM)
10:EBUS
11:MII/RMII/RGMII</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PORT0</name>
              <description>Port configuration:
00:Not implemented
01:Not configured (SII EEPROM)
10:EBUS
11:MII/RMII/RGMII</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FEATURE</name>
          <description>ESC Feature supported</description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <resetValue>0x008C</resetValue>
          <resetMask>0x0FCD</resetMask>
          <fields>
            <field>
              <name>FFSC</name>
              <description>Fixed FMMU/SyncManager configuration:
0:Variable configuration
1:Fixed configuration (refer to documentation of supporting ESCs)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RWC</name>
              <description>EtherCAT read/write command support(BRW,APRW,FPRW):
0:Supported
1:Not supported</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LRW</name>
              <description>EtherCAT LRW command support:
0:Supported
1:Not supported</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EDSA</name>
              <description>Enhanced DC SYNC Activation:
0:Not available
1:Available
Note:This feature refers to registers 0x981[7:3] and 0x0984</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SHFE</name>
              <description>Seperate Handling of FCS Errors:
0:Not supported
1:Supported, frames with wrong FCS and additional nibble will be counted separately in Forwarded RX Error Counter</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ELDM</name>
              <description>Enhanced Link Detection MII:
0:Not available
1:Available</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DCW</name>
              <description>Distributed Clocks width:
0:32 bit
1:64 bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DC</name>
              <description>Distributed Clocks:
0:Not available
1:Available</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FMMU</name>
              <description>FMMU Operation:
0:Bit oriented
1:Byte oriented</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATION_ADDR</name>
          <description>Configured Station Address</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Address used for node addressing
(FPRD/FPWR/FPRW/FRMW commands)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATION_ALS</name>
          <description>Configured Station Alias</description>
          <addressOffset>0x12</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Alias Address used for node addressing
(FPRD/FPWR/FPRW/FRMW commands).
The use of this alias is activated by Register
DL Control Bit 0x0100[24].
NOTE:EEPROM value is only transferred into this
register at first EEPROM load after power-on or
reset.
ESC20 exception:EEPROM value is transferred
into this register after each EEPROM reload
command.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WEN</name>
          <description>Register Write Enable</description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>If register write protection is enabled, this
register has to be written in the same
Ethernet frame (value does not matter)
before other writes to this station are allowed.
This bit is self-clearing at the beginning of the
next frame (SOF), or if Register Write
Protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_WP</name>
          <description>Register Write Protection</description>
          <addressOffset>0x21</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <fields>
            <field>
              <name>WP</name>
              <description>Register write protection:
0:Protection disabled
1:Protection enabled
Registers 0x0000:0x0F7F are write-protected,
except for 0x0020 and 0x0030</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESC_WEN</name>
          <description>ESC Write Enable</description>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>If ESC write protection is enabled, this
register has to be written in the same
Ethernet frame (value does not matter)
before other writes to this station are allowed.
This bit is self-clearing at the beginning of the
next frame (SOF), or if ESC Write Protection
is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESC_WP</name>
          <description>ESC Write Protection</description>
          <addressOffset>0x31</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <fields>
            <field>
              <name>WP</name>
              <description>Write protect:
0:Protection disabled
1:Protection enabled
All areas are write-protected, except for 0x0030.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESC_RST_ECAT</name>
          <description>ESC Reset ECAT</description>
          <addressOffset>0x40</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <fields>
            <field>
              <name>PR</name>
              <description>Progress of the reset procedure:
00:initial/reset state
01:after writing 0x52 ('R'), when previous
state was 00
10:after writing 0x45 ('E'), when previous
state was 01
11:after writing 0x53 ('S'), when previous
state was 10.
This value must not be observed
because the ESC enters reset when this
state is reached, resulting in state 00</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESC_RST_PDI</name>
          <description>ESC Reset PDI</description>
          <addressOffset>0x41</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>RST</name>
              <description>A reset is asserted after writing the reset
sequence 0x52 ('R'), 0x45 ('E') and 0x53 ('S')
in this register with 3 consecutive commands.
Any other command which does not continue
the sequence by writing the next expected
value will cancel the reset procedure</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESC_DL_CTRL</name>
          <description>ESC DL Control</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0107FF03</resetMask>
          <fields>
            <field>
              <name>SA</name>
              <description>Station alias:
0:Ignore Station Alias
1:Alias can be used for all configured
address comm</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RFS</name>
              <description>RX FIFO Size (ESC delays start of
forwarding until FIFO is at least half full).
RX FIFO Size/RX delay reduction** :
Value:EBUS:MII:
0:-50 ns -40 ns (-80 ns***)
1:-40 ns -40 ns (-80 ns***)
2:-30 ns -40 ns
3:-20 ns -40 ns
4:-10 ns no change
5:no change no change
6:no change no change
7:default default
NOTE:EEPROM value is only taken over at first
EEPROM load after power-on or reset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP3</name>
              <description>Loop Port 3:
00:Auto
01:Auto Close
10:Open
11:Closed</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP2</name>
              <description>Loop Port 2:
00:Auto
01:Auto Close
10:Open
11:Closed</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP1</name>
              <description>Loop Port 1:
00:Auto
01:Auto Close
10:Open
11:Closed</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP0</name>
              <description>Loop Port 0:
00:Auto
01:Auto Close
10:Open
11:Closed
NOTE:
Loop open means sending/receiving over this port
is enabled, loop closed means sending/receiving
is disabled and frames are forwarded to the next
open port internally.
Auto:loop closed at link down, opened at link up
Auto Close:loop closed at link down, opened with
writing 01 again after link up (or receiving a valid
Ethernet frame at the closed port)
Open:loop open regardless of link state
Closed:loop closed regardless of link state</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TU</name>
              <description>Temporary use of settings in
0x0100:0x0103[8:15]:
0:permanent use
1:use for about 1 second, then revert to
previous settings</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FR</name>
              <description>Forwarding rule:
0:Forward non-EtherCAT frames:
EtherCAT frames are processed,
non-EtherCAT frames are forwarded
without processing or modification.
The source MAC address is not
changed for any frame.
1:Destroy non-EtherCAT frames:
EtherCAT frames are processed, non-EtherCAT frames are destroyed.
The source MAC address is changed by
the Processing Unit for every frame
(SOURCE_MAC[1] is set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PHYSICAL_RW_OFFSET</name>
          <description>Physical Read/Write Offset</description>
          <addressOffset>0x108</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>This register is used for ReadWrite
commands in Device Addressing mode
(FPRW, APRW, BRW).
The internal read address is directly taken
from the offset address field of the EtherCAT
datagram header, while the internal write
address is calculated by adding the Physical
Read/Write Offset value to the offset address
field.
Internal read address = ADR,
internal write address = ADR + R/W-Offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
