hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/HPM5E00/HPM5E11/HPM5E11_svd.xml
        <register>
          <name>PHY_ADDR</name>
          <description>PHY Address</description>
          <addressOffset>0x512</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x9F</resetMask>
          <fields>
            <field>
              <name>SHOW</name>
              <description>Target PHY Address translation:
0:Enabled
1:Disabled
Refer to 0x0512[4:0] and 0x0510[7:3] for
details.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDR</name>
              <description>Target PHY Address
Translation 0x0512[7]=0:
0-3:Target PHY Addresses 0-3 are used
to access the PHYs at port 0-3, when
the PHY addresses are properly
configured
4-31:The configured PHY address of port 0
(PHY address offset) is added to the
Target PHY Address values 4-31
when accessing a PHY
Translation 0x0512[7]=1:
0-31:Target PHY Addresses is used when
accessing a PHY without translation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PHY_REG_ADDR</name>
          <description>PHY Register Address</description>
          <addressOffset>0x513</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Address of PHY Register that shall be
read/written</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PHY_DATA</name>
          <description>PHY Data</description>
          <addressOffset>0x514</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>PHY Read/Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIIM_ECAT_ACC_STAT</name>
          <description>MII Management ECAT Access State</description>
          <addressOffset>0x516</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <fields>
            <field>
              <name>ACC</name>
              <description>Access to MII management:
0:ECAT enables PDI takeover of MII
management interface
1:ECAT claims exclusive access to MII
management interface</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIIM_PDI_ACC_STAT</name>
          <description>MII Management PDI Access State</description>
          <addressOffset>0x517</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <fields>
            <field>
              <name>FORCE</name>
              <description>Force PDI Access State:
0:Do not change Bit 0x0517[0]
1:Reset Bit 0x0517[0] to 0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACC</name>
              <description>Access to MII management:
0:ECAT has access to MII management
1:PDI has access to MII management</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x1</dimIncrement>
          <dimIndex>PORT0,PORT1,PORT2,PORT3</dimIndex>
          <name>PHY_STAT[%s]</name>
          <description>no description available</description>
          <addressOffset>0x518</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>PCU</name>
              <description>PHY configuration updated:
0:No update
1:PHY configuration was updated
Cleared by writing any value to at least one
of the PHY Port y Status registers.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPE</name>
              <description>Link partner error:
0:No error detected
1:Link partner error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RE</name>
              <description>Read error:
0:No read error occurred
1:A read error has occurred
Cleared by writing any value to at least one
of the PHY Port y Status registers.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSE</name>
              <description>Link status error:
0:No error
1:Link error, link inhibited</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LS</name>
              <description>Link status (100 Mbit/s, Full Duplex, Auto
negotiation):
0:No link
1:Link detected</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PLS</name>
              <description>Physical link status (PHY status register 1.2):
0:No physical link
1:Physical link detected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>8</dim>
          <dimIncrement>0x10</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
          <name>FMMU[%s]</name>
          <description>no description available</description>
          <addressOffset>0x600</addressOffset>
          <register>
            <name>LOGIC_START_ADDR</name>
            <description>Logical Start Address</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ADDR</name>
                <description>Logical start address within the EtherCAT
Address Space.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LENGTH</name>
            <description>Length</description>
            <addressOffset>0x4</addressOffset>
            <size>16</size>
            <resetValue>0x0000</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>OFFSET</name>
                <description>Offset from the first logical FMMU byte to the
last FMMU byte + 1 (e.g., if two bytes are
used, then this parameter shall contain 2)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LOGIC_START_BIT</name>
            <description>Logical Start Bit</description>
            <addressOffset>0x6</addressOffset>
            <size>8</size>
            <resetValue>0x00</resetValue>
            <resetMask>0x07</resetMask>
            <fields>
              <field>
                <name>START</name>
                <description>Logical starting bit that shall be mapped (bits
are counted from least significant bit 0 to
most significant bit 7)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LOGIC_STOP_BIT</name>
            <description>Logical Stop Bit</description>
            <addressOffset>0x7</addressOffset>
            <size>8</size>
            <resetValue>0x00</resetValue>
            <resetMask>0x07</resetMask>
            <fields>
              <field>
                <name>STOP</name>
                <description>Last logical bit that shall be mapped (bits are
counted from least significant bit 0 to most
significant bit 7)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PHYSICAL_START_ADDR</name>
            <description>Physical Start Address</description>
            <addressOffset>0x8</addressOffset>
            <size>16</size>
            <resetValue>0x0000</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>ADDR</name>
                <description>Physical Start Address (mapped to logical
Start address)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PHYSICAL_START_BIT</name>
            <description>Physical Start Bit</description>
            <addressOffset>0xa</addressOffset>
            <size>8</size>
            <resetValue>0x00</resetValue>
            <resetMask>0x07</resetMask>
            <fields>
              <field>
                <name>START</name>
                <description>Physical starting bit as target of logical start
bit mapping (bits are counted from least
significant bit 0 to most significant bit 7)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TYPE</name>
            <description>Type</description>
            <addressOffset>0xb</addressOffset>
            <size>8</size>
            <resetValue>0x00</resetValue>
            <resetMask>0x03</resetMask>
            <fields>
              <field>
                <name>MAP_WR</name>
                <description>0:Ignore mapping for write accesses
1:Use mapping for write accesses</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>MAP_RD</name>
                <description>0:Ignore mapping for read accesses
1:Use mapping for read accesses</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ACTIVATE</name>
            <description>Activate</description>
            <addressOffset>0xc</addressOffset>
            <size>8</size>
            <resetValue>0x00</resetValue>
            <resetMask>0x01</resetMask>
            <fields>
              <field>
                <name>ACT</name>
                <description>0:FMMU deactivated
1:FMMU activated. FMMU checks
logically addressed blocks to be
mapped according to configured
mapping</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>8</dim>
          <dimIncrement>0x8</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
          <name>SYNCM[%s]</name>
          <description>no description available</description>
          <addressOffset>0x800</addressOffset>
          <register>
            <name>PHYSICAL_START_ADDR</name>
            <description>Physical Start Address</description>
            <addressOffset>0x0</addressOffset>
            <size>16</size>
            <resetValue>0x0000</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>ADDR</name>
                <description>First byte that will be handled by
SyncManager</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LENGTH</name>
            <description>Length</description>
            <addressOffset>0x2</addressOffset>
            <size>16</size>
            <resetValue>0x0000</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>LEN</name>
                <description>Number of bytes assigned to SyncManager
(shall be greater than 1, otherwise
SyncManager is not activated. If set to 1, only
Watchdog Trigger is generated if configured)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONTROL</name>
            <description>Control</description>
            <addressOffset>0x4</addressOffset>
            <size>8</size>
            <resetValue>0x00</resetValue>
            <resetMask>0x7F</resetMask>
            <fields>
              <field>
                <name>WDG_TRG_EN</name>
                <description>Watchdog Trigger Enable:
0:Disabled
1:Enabled</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INT_AL</name>
                <description>Interrupt in AL Event Request Register:
0:Disabled
1:Enabled</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INT_ECAT</name>
                <description>Interrupt in ECAT Event Request Register:
0:Disabled
1:Enabled</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DIR</name>
                <description>Direction:
00:Read:ECAT read access, PDI write
access.
01:Write:ECAT write access, PDI read
access.
10:Reserved
11:Reserved</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OP_MODE</name>
                <description>Operation Mode:
00:Buffered (3 buffer mode)
01:Reserved
10:Mailbox (Single buffer mode)
11:Reserved</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS</name>
            <description>Status</description>
            <addressOffset>0x5</addressOffset>
            <size>8</size>
            <resetValue>0x00</resetValue>
            <resetMask>0xFB</resetMask>
            <fields>
              <field>
                <name>WB_INUSE</name>
                <description>Write buffer in use (opened)</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>RB_INUSE</name>
                <description>Read buffer in use (opened)</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>BUF_MODE</name>
                <description>Buffered mode:buffer status (last written
buffer):
00:1
st buffer
01:2
nd buffer
10:3
rd buffer
11:(no buffer written)
Mailbox mode:reserved</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>MBX_MODE</name>
                <description>Mailbox mode:mailbox status:
0:Mailbox empty
1:Mailbox full
Buffered mode:reserved</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INT_RD</name>
                <description>Interrupt Read:
1:Interrupt after buffer was completely and
successfully read
0:Interrupt cleared after first byte of buffer
was written
NOTE:This interrupt is signalled to the writing
side if enabled in the SM Control register</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INT_WR</name>
                <description>Interrupt Write:
1:Interrupt after buffer was completely and
successfully written
0:Interrupt cleared after first byte of buffer
was read
NOTE:This interrupt is signalled to the reading
side if enabled in the SM Control register</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ACTIVATE</name>
            <description>Activate</description>
            <addressOffset>0x6</addressOffset>
            <size>8</size>
            <resetValue>0x00</resetValue>
            <resetMask>0xC3</resetMask>
            <fields>
              <field>
                <name>LATCH_PDI</name>
                <description>Latch Event PDI:
0:No
1:Generate Latch events when PDI issues
a buffer exchange or when PDI
accesses buffer start address</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>LATCH_ECAT</name>
                <description>Latch Event ECAT:
0:No
1:Generate Latch event when EtherCAT
master issues a buffer exchange</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>REPEAT</name>
                <description>Repeat Request:
A toggle of Repeat Request means that a
mailbox retry is needed (primarily used in
conjunction with ECAT Read Mailbox)</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>EN</name>
                <description>SyncManager Enable/Disable:
0:Disable:Access to Memory without
SyncManager control
1:Enable:SyncManager is active and
controls Memory area set in
configuration</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PDI_CTRL</name>
            <description>PDI Control</description>
            <addressOffset>0x7</addressOffset>
            <size>8</size>
            <resetValue>0x00</resetValue>
            <resetMask>0x03</resetMask>
            <fields>
              <field>
                <name>REPEAT_ACK</name>
                <description>Repeat Ack:
If this is set to the same value as that set by
Repeat Request, the PDI acknowledges the
execution of a previous set Repeat request.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DEACT</name>
                <description>Deactivate SyncManager:
Read:
0:Normal operation, SyncManager
activated.
1:SyncManager deactivated and reset.
SyncManager locks access to Memory
area.
Write:
0:Activate SyncManager
1:Request SyncManager deactivation
NOTE:Writing 1 is delayed until the end of the
frame, which is currently processed.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
