hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/HPM5E00/HPM5E11/HPM5E11_svd.xml
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>PORT0,PORT1,PORT2,PORT3</dimIndex>
          <name>RCV_TIME[%s]</name>
          <description>no description available</description>
          <addressOffset>0x900</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LT</name>
              <description>Local time at the beginning of the last receive
frame containing a write access to register
0x0900.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REQ</name>
              <description>Write:
A write access to register 0x0900 with
BWR or FPWR latches the local time at
the beginning of the receive frame (start
first bit of preamble) at each port.
Write (ESC20, ET1200 exception):
A write access latches the local time at
the beginning of the receive frame at
port 0. It enables the time stamping at
the other ports.
Read:
Local time at the beginning of the last
receive frame containing a write access
to this register.
NOTE:FPWR requires an address match for
accessing this register like any FPWR command.
All write commands with address match will
increment the working counter (e.g., APWR), but
they will not trigger receive time latching.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS_TIME</name>
          <description>System Time</description>
          <addressOffset>0x910</addressOffset>
          <size>64</size>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ST</name>
              <description>No description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>64</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCVT_ECAT_PU</name>
          <description>Receive Time ECAT Processing Unit</description>
          <addressOffset>0x918</addressOffset>
          <size>64</size>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LT</name>
              <description>Local time at the beginning of a frame (start
first bit of preamble) received at the ECAT
Processing Unit containing a write access to
register 0x0900
NOTE:E.g., if port 0 is open, this register reflects
the Receive Time Port 0 as a 64 Bit value.
Any valid EtherCAT write access to register
0x0900 triggers latching, not only BWR/FPWR
commands as with register 0x0900.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>64</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS_TIME_OFFSET</name>
          <description>System Time Offset</description>
          <addressOffset>0x920</addressOffset>
          <size>64</size>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Difference between local time and System
Time. Offset is added to the local time.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>64</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS_TIME_DELAY</name>
          <description>System Time Delay</description>
          <addressOffset>0x928</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLY</name>
              <description>Delay between Reference Clock and the
ESC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS_TIME_DIFF</name>
          <description>System Time Difference</description>
          <addressOffset>0x92c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIFF</name>
              <description>0:Local copy of System Time less than
received System Time
1:Local copy of System Time greater than
or equal to received System Time</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM</name>
              <description>Mean difference between local copy of
System Time and received System Time
values
Difference = Received System Time –
local copy of System Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPD_CNT_START</name>
          <description>Speed Counter Start</description>
          <addressOffset>0x930</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0x7FFF</resetMask>
          <fields>
            <field>
              <name>BW</name>
              <description>Bandwidth for adjustment of local copy of
System Time (larger values → smaller
bandwidth and smoother adjustment)
A write access resets System Time
Difference (0x092C:0x092F) and Speed
Counter Diff (0x0932:0x0933).
Valid values:0x0080 to 0x3FFF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPD_CNT_DIFF</name>
          <description>Speed Counter Diff</description>
          <addressOffset>0x932</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DIFF</name>
              <description>Representation of the deviation between
local clock period and Reference Clock's
clock period (representation:two's
complement)
Range:±(Speed Counter Start – 0x7F)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS_TIME_DIFF_FD</name>
          <description>System Time Difference Filter Depth</description>
          <addressOffset>0x934</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <fields>
            <field>
              <name>DEPTH</name>
              <description>Filter depth for averaging the received
System Time deviation
IP Core since V2.2.0/V2.02a:
A write access resets System Time
Difference (0x092C:0x092F)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPD_CNT_FD</name>
          <description>Speed Counter Filter Depth</description>
          <addressOffset>0x935</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <fields>
            <field>
              <name>DEPTH</name>
              <description>Filter depth for averaging the clock period
deviation
IP Core since V2.2.0/V2.02a:
A write access resets the internal speed
counter filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCV_TIME_LM</name>
          <description>Receive Time Latch Mode</description>
          <addressOffset>0x936</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <fields>
            <field>
              <name>LATCH_MODE</name>
              <description>Receive Time Latch Mode:
0:Forwarding mode (used if frames are
entering the ESC at port 0 first):
Receive time stamps of ports 1-3 are
enabled after the write access to
0x0900, so the following frame at ports
1-3 will be time stamped (this is typically
the write frame to 0x0900 coming back
from the network behind the ESC).
1:Reverse mode (used if frames are
entering ESC at port 1-3 first):
Receive time stamps of ports 1-3 are
immediately taken over from the internal
hidden time stamp registers, so the
previous frame entering the ESC at
ports 1-3 will be time stamped when the
write frame to 0x0900 enters port 0 (the
previous frame at ports 1-3 is typically
the write frame to 0x0900 coming from
the master, which will enable time
stamp</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CYC_UNIT_CTRL</name>
          <description>Cyclic Unit Control</description>
          <addressOffset>0x980</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x31</resetMask>
          <fields>
            <field>
              <name>LATCHI1</name>
              <description>Latch In unit 1:
0:ECAT-controlled
1:PDI-controlled
NOTE:Latch interrupt is routed to ECAT/PDI
depending on this setting</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LATCHI0</name>
              <description>Latch In unit 0:
0:ECAT-controlled
1:PDI-controlled
NOTE:Latch interrupt is routed to ECAT/PDI
depending on this setting.
Always 1 (PDI-controlled) if System Time is PDIcontrolled.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYNCO</name>
              <description>Cyclic Unit and SYNC0 out unit control:
0:ECAT-controlled
1:PDI-controlled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCO_ACT</name>
          <description>SYNC Out Unit Activation</description>
          <addressOffset>0x981</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>SSDP</name>
              <description>SyncSignal debug pulse (Vasily bit):
0:Deactivated
1:Immediately generate one ping only on
SYNC0-1 according to 0x0981[2:1 for
debugging
This bit is self-clearing, always read 0.
All pulses are generated at the same time,
the cycle time is ignored. The configured
pulse length is used.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NFC</name>
              <description>Near future configuration (approx.):
0:½ DC width future (231 ns or 263 ns)
1:~2.1 sec. future (231 ns)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STPC</name>
              <description>Start Time plausibility check:
0:Disabled. SyncSignal generation if Start
Time is reached.
1:Immediate SyncSignal generation if
Start Time is outside near future (see
0x0981[6])</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXT</name>
              <description>Extension of Start Time Cyclic Operation
(0x0990:0x0993):
0:No extension
1:Extend 32 bit written Start Time to 64 bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AC</name>
              <description>Auto-activation by writing Start Time Cyclic
Operation (0x0990:0x0997):
0:Disabled
1:Auto-activation enabled. 0x0981[0] is
set automatically after Start Time is
written.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC1_GEN</name>
              <description>SYNC1 generation:
0:Deactivated
1:SYNC1 pulse is generated</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC0_GEN</name>
              <description>SYNC0 generation:
0:Deactivated
1:SYNC0 pulse is generated</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOUA</name>
              <description>Sync Out Unit activation:
0:Deactivated
1:Activated</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PULSE_LEN</name>
          <description>Pulse Length of SyncSignals</description>
          <addressOffset>0x982</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>LEN</name>
              <description>Pulse length of SyncSignals (in Units of
10ns)
0:Acknowledge mode:SyncSignal will be
cleared by reading SYNC[1:0] Status
register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACT_STAT</name>
          <description>Activation Status</description>
          <addressOffset>0x984</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x07</resetMask>
          <fields>
            <field>
              <name>CHK_RSLT</name>
              <description>Start Time Cyclic Operation (0x0990:0x0997)
plausibility check result when Sync Out Unit
was activated:
0:Start Time was within near future
1:Start Time was out of near future
(0x0981[6])</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYNC1</name>
              <description>SYNC1 activation state:
0:First SYNC1 pulse is not pending
1:First SYNC1 pulse is pending</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYNC0</name>
              <description>SYNC0 activation state:
0:First SYNC0 pulse is not pending
1:First SYNC0 pulse is pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC0_STAT</name>
          <description>SYNC0 Status</description>
          <addressOffset>0x98e</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <fields>
            <field>
              <name>ACK</name>
              <description>SYNC0 state for Acknowledge mode.
SYNC0 in Acknowledge mode is cleared by
reading this register from PDI, use only in
Acknowledge mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC1_STAT</name>
          <description>SYNC1 Status</description>
          <addressOffset>0x98f</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <fields>
            <field>
              <name>ACK</name>
              <description>SYNC1 state for Acknowledge mode.
SYNC1 in Acknowledge mode is cleared by
reading this register from PDI, use only in
Acknowledge mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>START_TIME_CO</name>
          <description>Start Time Cyclic Operation</description>
          <addressOffset>0x990</addressOffset>
          <size>64</size>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ST</name>
              <description>Write:Start time (System time) of cyclic
operation in ns
Read:System time of next SYNC0 pulse in
ns</description>
              <bitOffset>0</bitOffset>
              <bitWidth>64</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NXT_SYNC1_PULSE</name>
          <description>Next SYNC1 Pulse</description>
          <addressOffset>0x998</addressOffset>
          <size>64</size>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIME</name>
              <description>System time of next SYNC1 pulse in ns</description>
              <bitOffset>0</bitOffset>
              <bitWidth>64</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC0_CYC_TIME</name>
          <description>SYNC0 Cycle Time</description>
          <addressOffset>0x9a0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CYC</name>
              <description>Time between two consecutive SYNC0
pulses in ns.
0:Single shot mode, generate only one
SYNC0 pulse.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC1_CYC_TIME</name>
          <description>SYNC1 Cycle Time</description>
          <addressOffset>0x9a4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CYC</name>
              <description>Time between SYNC0 pulse and SYNC1
pulse in ns</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LATCH0_CTRL</name>
          <description>Latch0 Control</description>
          <addressOffset>0x9a8</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <fields>
            <field>
              <name>NEG_EDGE</name>
              <description>Latch0 negative edge:
0:Continuous Latch active
1:Single event (only first event active)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POS_EDGE</name>
              <description>Latch0 positive edge:
0:Continuous Latch active
1:Single event (only first event active)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LATCH1_CTRL</name>
          <description>Latch1 Control</description>
          <addressOffset>0x9a9</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <fields>
            <field>
              <name>NEG_EDGE</name>
              <description>Latch1 negative edge:
0:Continuous Latch active
1:Single event (only first event active)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POS_EDGE</name>
              <description>Latch1 positive edge:
0:Continuous Latch active
1:Single event (only first event active)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
