hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/HPM5E00/HPM5E11/HPM5E11_svd.xml
        <register>
          <name>LATCH0_STAT</name>
          <description>Latch0 Status</description>
          <addressOffset>0x9ae</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x07</resetMask>
          <fields>
            <field>
              <name>PIN_STAT</name>
              <description>Latch0 pin state</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NEG_EDGE</name>
              <description>Event Latch0 negative edge.
0:Negative edge not detected or
continuous mode
1:Negative edge detected in single event
mode only.
Flag cleared by reading out Latch0 Time
Negative Edge.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>POS_EDGE</name>
              <description>Event Latch0 positive edge.
0:Positive edge not detected or
continuous mode
1:Positive edge detected in single event
mode only.
Flag cleared by reading out Latch0 Time
Positive Edge.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LATCH1_STAT</name>
          <description>Latch1 Status</description>
          <addressOffset>0x9af</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x07</resetMask>
          <fields>
            <field>
              <name>PIN_STAT</name>
              <description>Latch1 pin state</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NEG_EDGE</name>
              <description>Event Latch1 negative edge.
0:Negative edge not detected or
continuous mode
1:Negative edge detected in single event
mode only.
Flag cleared by reading out Latch1 Time
Negative Edge.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>POS_EDGE</name>
              <description>Event Latch1 positive edge.
0:Positive edge not detected or
continuous mode
1:Positive edge detected in single event
mode only.
Flag cleared by reading out Latch1 Time
Positive Edge.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LATCH0_TIME_PE</name>
          <description>Latch0 Time Positive Edge</description>
          <addressOffset>0x9b0</addressOffset>
          <size>64</size>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIME</name>
              <description>System time at the positive edge of the
Latch0 signal.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>64</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LATCH0_TIME_NE</name>
          <description>Latch0 Time Negative Edge</description>
          <addressOffset>0x9b8</addressOffset>
          <size>64</size>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIME</name>
              <description>System time at the negative edge of the
Latch0 signal.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>64</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LATCH1_TIME_PE</name>
          <description>Latch1 Time Positive Edge</description>
          <addressOffset>0x9c0</addressOffset>
          <size>64</size>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIME</name>
              <description>System time at the positive edge of the
Latch1 signal.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>64</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LATCH1_TIME_NE</name>
          <description>Latch1 Time Negative Edge</description>
          <addressOffset>0x9c8</addressOffset>
          <size>64</size>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIME</name>
              <description>System time at the negative edge of the
Latch1 signal.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>64</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECAT_BUF_CET</name>
          <description>EtherCAT Buffer Change Event Time</description>
          <addressOffset>0x9f0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIME</name>
              <description>Local time at the beginning of the frame
which causes at least one SyncManager to
assert an ECAT event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDI_BUF_SET</name>
          <description>PDI Buffer Start Event Time</description>
          <addressOffset>0x9f8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIME</name>
              <description>Local time when at least one SyncManager
asserts a PDI buffer start event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDI_BUF_CET</name>
          <description>PDI Buffer Change Event Time</description>
          <addressOffset>0x9fc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIME</name>
              <description>Local time when at least one SyncManager
asserts a PDI buffer change event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PID</name>
          <description>Product ID</description>
          <addressOffset>0xe00</addressOffset>
          <size>64</size>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PID</name>
              <description>Product ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>64</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VID</name>
          <description>Vendor ID</description>
          <addressOffset>0xe08</addressOffset>
          <size>64</size>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VID</name>
              <description>Vendor ID:
23-0: Company
31-24: Department
NOTE:Test Vendor IDs have [31:28]=0xE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>64</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIO_OUT_DATA</name>
          <description>Digital I/O Output Data</description>
          <addressOffset>0xf00</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OD</name>
              <description>Output Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPO</name>
          <description>General Purpose Outputs</description>
          <addressOffset>0xf10</addressOffset>
          <size>64</size>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPOD</name>
              <description>General Purpose Output Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>64</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPI</name>
          <description>General Purpose Inputs</description>
          <addressOffset>0xf18</addressOffset>
          <size>64</size>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPID</name>
              <description>General Purpose Input Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>64</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USER_RAM_BYTE0</name>
          <description>User Ram Byte 0</description>
          <addressOffset>0xf80</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>EXTF</name>
              <description>Number of extended feature bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USER_RAM_BYTE1</name>
          <description>User Ram Byte 1</description>
          <addressOffset>0xf81</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PRWO</name>
              <description>Physical Read/Write Offset (0x0108:0x0109)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AEMW</name>
              <description>AL Event Mask writable (0x0204:0x0207)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPO</name>
              <description>General Purpose Outputs (0x0F10:0x0F17)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPI</name>
              <description>General Purpose Inputs (0x0F18:0x0F1F)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSA</name>
              <description>Configured Station Alias (0x0012:0x0013)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EIM</name>
              <description>ECAT Interrupt Mask (0x0200:0x0201)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALSCR</name>
              <description>AL Status Code Register (0x0134:0x0135)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EDLCR</name>
              <description>Extended DL Control Register (0x0102:0x0103)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USER_RAM_BYTE2</name>
          <description>User Ram Byte 2</description>
          <addressOffset>0xf82</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xEF</resetMask>
          <fields>
            <field>
              <name>ESCFG</name>
              <description>EEPROM Size configurable (0x0502[7]):
0:EEPROM Size fixed to sizes up to 16 Kbit
1:EEPROM Size configurable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPUPEC</name>
              <description>ECAT Processing Unit/PDI Error Counter
(0x030C:0x030D)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCSMET</name>
              <description>DC SyncManager Event Times (0x09F0:0x09FF)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET</name>
              <description>Reset (0x0040:0x0041)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WP</name>
              <description>Write Protection (0x0020:0x0031)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDGCNT</name>
              <description>Watchdog counters (0x0442:0x0443)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDW</name>
              <description>Watchdog divider writable (0x0400:0x0401) and
Watchdog PDI (0x0410:0x0411)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USER_RAM_BYTE3</name>
          <description>User Ram Byte 3</description>
          <addressOffset>0xf83</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xF8</resetMask>
          <fields>
            <field>
              <name>RLED</name>
              <description>Run LED (DEV_STATE LED)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ELDE</name>
              <description>Enhanced Link Detection EBUS</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ELDM</name>
              <description>Enhanced Link Detection MII</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MMI</name>
              <description>MII Management Interface (0x0510:0x0515)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LLC</name>
              <description>Lost Link Counter (0x0310:0x0313)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USER_RAM_BYTE4</name>
          <description>User Ram Byte 4</description>
          <addressOffset>0xf84</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xE9</resetMask>
          <fields>
            <field>
              <name>LDCM</name>
              <description>Link detection and configuration by MI</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTLC</name>
              <description>DC Time loop control assigned to PDI</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSOU</name>
              <description>DC Sync Out Unit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLIU</name>
              <description>DC Latch In Unit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LALED</name>
              <description>Link/Activity LED</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USER_RAM_BYTE5</name>
          <description>User Ram Byte 5</description>
          <addressOffset>0xf85</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x27</resetMask>
          <fields>
            <field>
              <name>DDIOR</name>
              <description>Disable Digital I/O register (0x0F00:0x0F03)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EEU</name>
              <description>EEPROM emulation by µController</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATS</name>
              <description>Automatic TX shift</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCPP</name>
              <description>MI control by PDI possible</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USER_RAM_BYTE6</name>
          <description>User Ram Byte 6</description>
          <addressOffset>0xf86</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x04</resetMask>
          <fields>
            <field>
              <name>RELEDOR</name>
              <description>RUN/ERR LED Override (0x0138:0x0139)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USER_RAM_BYTE7</name>
          <description>User Ram Byte 7</description>
          <addressOffset>0xf87</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xC8</resetMask>
          <fields>
            <field>
              <name>DCST</name>
              <description>DC System Time (0x0910:0x0936)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCRT</name>
              <description>DC Receive Times (0x0900:0x090F)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCS1D</name>
              <description>DC Sync1 disable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
