hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/HPM5E00/HPM5E11/HPM5E11_svd.xml
        <register>
          <name>USER_RAM_BYTE8</name>
          <description>User Ram Byte 8</description>
          <addressOffset>0xf88</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x3D</resetMask>
          <fields>
            <field>
              <name>PPDI</name>
              <description>PLB PDI</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPDI</name>
              <description>OPB PDI</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APDI</name>
              <description>Avalon PDI</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDICEC</name>
              <description>PDI clears error counter</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DC64</name>
              <description>DC 64 bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USER_RAM_BYTE9</name>
          <description>User Ram Byte 9</description>
          <addressOffset>0xf89</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x80</resetMask>
          <fields>
            <field>
              <name>DR</name>
              <description>Direct RESET</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USER_RAM_BYTE10</name>
          <description>User Ram Byte 10</description>
          <addressOffset>0xf8a</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xCC</resetMask>
          <fields>
            <field>
              <name>PDIIR</name>
              <description>PDI Information register (0x014E:0x014F)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIFA</name>
              <description>PDI function acknowledge by PDI write</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APDI</name>
              <description>AXI PDI</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCL1D</name>
              <description>DC Latch1 disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USER_RAM_BYTE11</name>
          <description>User Ram Byte 11</description>
          <addressOffset>0xf8b</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x08</resetMask>
          <fields>
            <field>
              <name>LEDTST</name>
              <description>LED test</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USER_RAM_BYTE14</name>
          <description>User Ram Byte 14</description>
          <addressOffset>0xf8e</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xC0</resetMask>
          <fields>
            <field>
              <name>DIOBS</name>
              <description>Digital I/O PDI byte size</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USER_RAM_BYTE15</name>
          <description>User Ram Byte 15</description>
          <addressOffset>0xf8f</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x1C</resetMask>
          <fields>
            <field>
              <name>AUCPDI</name>
              <description>Asynchronous µC PDI</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SSPDI</name>
              <description>SPI Slave PDI</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIOPDI</name>
              <description>Digital I/O PDI</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USER_RAM_BYTE19</name>
          <description>User Ram Byte 19</description>
          <addressOffset>0xf93</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x77</resetMask>
          <fields>
            <field>
              <name>SCP</name>
              <description>Security CPLD protection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMII</name>
              <description>RMII</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>URGP</name>
              <description>Use RGMII GTX_CLK phase shifted clock input</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CIA</name>
              <description>CLK_PDI_EXT is asynchronous</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPARO</name>
              <description>Individual PHY address read out (0x0510[7:3])</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RGMII</name>
              <description>RGMII</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDRAM</name>
          <description>Process Data Ram</description>
          <addressOffset>0x1000</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Input Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDRAM_ALS</name>
          <description>Process Data Ram Alias</description>
          <addressOffset>0x10000</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>No description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR_CFG0</name>
          <description>General Purpose Configure 0</description>
          <addressOffset>0x1f000</addressOffset>
          <size>32</size>
          <resetValue>0x00001000</resetValue>
          <resetMask>0x00073039</resetMask>
          <fields>
            <field>
              <name>PORT2_DIS</name>
              <description>set to disable related port(read data 00 in core reigster Port Descriptor (0x0007)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORT1_DIS</name>
              <description>set to disable related port(read data 00 in core reigster Port Descriptor (0x0007)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORT0_DIS</name>
              <description>set to disable related port(read data 00 in core reigster Port Descriptor (0x0007)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK100_EN</name>
              <description>No description available</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EEPROM_EMU</name>
              <description>1 is EEPROM emulation mode (default)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC1_PDI_IRQEN</name>
              <description>set to enable SYNC1 generate PDI interrupt, also set PDI_SL_CFG.SYNC1_MAER(0x151.bit7)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC0_PDI_IRQEN</name>
              <description>set to enable SYNC0 generate PDI interrupt, also set PDI_SL_CFG.SYNC1_MAER(0x151.bit3)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_SCLK_EN</name>
              <description>No description available</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PROM_SIZE</name>
              <description>Sets EEPROM size:
0:up to 16 kbit EEPROM
1:32 kbit-4Mbit EEPROM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR_CFG1</name>
          <description>General Purpose Configure 1</description>
          <addressOffset>0x1f004</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xE00033C0</resetMask>
          <fields>
            <field>
              <name>SYNC1_IRQ_EN</name>
              <description>No description available</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC0_IRQ_EN</name>
              <description>No description available</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTO_IRQ_EN</name>
              <description>No description available</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC1_DMA_EN</name>
              <description>No description available</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC0_DMA_EN</name>
              <description>No description available</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LATCH1_FROM_IO</name>
              <description>0:from NTM</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LATCH0_FROM_IO</name>
              <description>0:from TRIGGER_MUX</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTO_OVRD</name>
              <description>No description available</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTO_OVRD_ENJ</name>
              <description>No description available</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR_CFG2</name>
          <description>General Purpose Configure 2</description>
          <addressOffset>0x1f008</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x33300000</resetMask>
          <fields>
            <field>
              <name>NMII_LINK2_FROM_IO</name>
              <description>No description available</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NMII_LINK2_GPR</name>
              <description>No description available</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NMII_LINK1_FROM_IO</name>
              <description>No description available</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NMII_LINK1_GPR</name>
              <description>No description available</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NMII_LINK0_FROM_IO</name>
              <description>No description available</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NMII_LINK0_GPR</name>
              <description>No description available</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PHY_CFG0</name>
          <description>PHY Configure 0</description>
          <addressOffset>0x1f010</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x5F808080</resetMask>
          <fields>
            <field>
              <name>MAC_SPEED</name>
              <description>1:100M</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_OFFSET_VAL</name>
              <description>No description available</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORT2_RMII_EN</name>
              <description>No description available</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORT1_RMII_EN</name>
              <description>No description available</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORT0_RMII_EN</name>
              <description>No description available</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PHY_CFG1</name>
          <description>PHY Configure 1</description>
          <addressOffset>0x1f014</addressOffset>
          <size>32</size>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x000007FF</resetMask>
          <fields>
            <field>
              <name>RMII_REFCLK_SEL</name>
              <description>0:use RXCK as 50M refclk. 1:use TXCK as 50M refclk</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFCK_25M_INV</name>
              <description>No description available</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMII_P2_RXCK_REFCLK_OE</name>
              <description>No description available</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMII_P1_RXCK_REFCLK_OE</name>
              <description>No description available</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMII_P0_RXCK_REFCLK_OE</name>
              <description>No description available</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFCK_25M_OE</name>
              <description>No description available</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMII_P2_TXCK_REFCLK_OE</name>
              <description>No description available</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMII_P1_TXCK_REFCLK_OE</name>
              <description>No description available</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMII_P0_TXCK_REFCLK_OE</name>
              <description>No description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
