hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/HPM5E00/HPM5E11/HPM5E11_svd.xml
        <register>
          <name>GPIO_CTRL</name>
          <description>GPIO Output Enable</description>
          <addressOffset>0x1f020</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xC0003F1F</resetMask>
          <fields>
            <field>
              <name>SW_LATCH_GPI</name>
              <description>if gpi_trig_sel is set to 4'b1001, setting this bit will latch GPI to gpi_reg0/1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SW_LATCH_GPO</name>
              <description>if gpo_trig_sel is set to 4'b1001, setting this bit will latch GPO to gpo_reg0/1</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPI_OVERRIDE_EN</name>
              <description>set this bit will use GPI from the software register gpi_override0/1
clr to use GPI from pad directly</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPI_TRIG_EN</name>
              <description>use gpi_trig_sel can select the trigger event to latch GPI signal(from reg or pad)
set to use triggered signal;
clr to use signals direclty(from reg or pad)
assign pdi_gpi = gpi_trig_en ? gpi_reg :
               (gpi_override_en ? gpi_override :pad_di_ecat_gpi);</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPI_TRIG_SEL</name>
              <description>select the trigger signal to latch GPI.
0000: SOF;  0001: EOF;  0010: pos of  SYNC0;  0011: pos of SYNC1;
0100: pos of LATCH0;   0101: pos of LATCH1;   0110: neg of LATCH0;   0111: neg of LATCH1
1000: wdog trigger;   1001: sw set gpio_ctrl[31];   1110: use gpi_trg_cfg for separate byte control
others no trigger</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPO_TRIG_EN</name>
              <description>use gpo_trig_sel can select the trigger event to latch GPO signal(from core)
set to use triggered signal;
clr to use GPO signals direclty(from reg or pad)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPO_TRIG_SEL</name>
              <description>select the trigger signal to latch GPO.
0000: SOF;  0001: EOF;  0010: pos of  SYNC0;  0011: pos of SYNC1;
0100: pos of LATCH0;   0101: pos of LATCH1;   0110: neg of LATCH0;   0111: neg of LATCH1
1000: wdog trigger;   1001: sw set gpio_ctrl[30];     1110: use gpo_trg_cfg for separate byte control
others no trigger</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPI_TRIG_CFG</name>
          <description>GPI trigger config</description>
          <addressOffset>0x1f024</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPI_TRIG_CFG</name>
              <description>separage GPI trigger control for latch GPI, 0000~1001 are same as gpi_trig_sel, just 4bit for one byte.
Bit3:0 to control GPI[7:0],   bit7:4 to control GPI[15:8]…    bit31:28 to control GPI[63:56]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPO_TRIG_CFG</name>
          <description>GPO trigger config</description>
          <addressOffset>0x1f028</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPO_TRIG_CFG</name>
              <description>separage GPO trigger control for latch GPO, 0000~1001 are same as gpo_trig_sel, just 4bit for one byte.
Bit3:0 to control GPO[7:0],   bit7:4 to control GPO[15:8]…    bit31:28 to control GPO[63:56]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPI_OVERRIDE0</name>
          <description>GPI low word Override value</description>
          <addressOffset>0x1f030</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPR_OVERRIDE_LOW</name>
              <description>No description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPI_OVERRIDE1</name>
          <description>GPI high word Override value</description>
          <addressOffset>0x1f034</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPR_OVERRIDE_HIGH</name>
              <description>No description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPO_REG0</name>
          <description>GPO low word read value</description>
          <addressOffset>0x1f038</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>No description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPO_REG1</name>
          <description>GPO high word read value</description>
          <addressOffset>0x1f03c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>No description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPI_REG0</name>
          <description>GPI low word read value</description>
          <addressOffset>0x1f040</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>No description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPI_REG1</name>
          <description>GPI high word read value</description>
          <addressOffset>0x1f044</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>No description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR_STATUS</name>
          <description>global status register</description>
          <addressOffset>0x1f060</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF037F</resetMask>
          <fields>
            <field>
              <name>NLINK2_PADSEL</name>
              <description>No description available</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NLINK1_PADSEL</name>
              <description>No description available</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NLINK0_PADSEL</name>
              <description>No description available</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PDI_SOF</name>
              <description>No description available</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PDI_EOF</name>
              <description>No description available</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PDI_WD_TRIGGER</name>
              <description>No description available</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PDI_WD_STATE</name>
              <description>No description available</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYNC_OUT1</name>
              <description>No description available</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYNC_OUT0</name>
              <description>No description available</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LED_STATE_RUN</name>
              <description>No description available</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LED_ERR</name>
              <description>No description available</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LED_RUN</name>
              <description>No description available</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DEV_STATE</name>
              <description>No description available</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LINK_ACT</name>
              <description>No description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>9</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>CTR0,CTR1,CTR2,CTR3,CTR4,CTR5,CTR6,CTR7,CTR8</dimIndex>
          <name>IO_CFG[%s]</name>
          <description>no description available</description>
          <addressOffset>0x1f080</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>INVERT</name>
              <description>1:invert the IO</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_ALT</name>
              <description>IO usage:
0:NMII_LINK0
1:NMII_LINK1
2:NMII_LINK2
3:LINK_ACT0
4:LINK_ACT1
5:LINK_ACT2
6:LED_RUN
7:LED_ERR
8:RESET_OUT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
